# Класс "Заметка", разновидность базового класса "Запись"
class Memo < Post

  # отдельный конструктор здесь не нужен, т. к. он совпадает с родительским
  # метод будет спрашивать ввод содержимого Заметки
  def read_from_console
    puts "Новая заметка (все, что пишите до строчки \"end\"):"
    @text = []

    line = nil

    while line != "end" do
      line = STDIN.gets.chomp  #Читаем очередную строку и записываем в массив @text
      @text << line
    end
    # Теперь удалим последний элемент из массива @text – там служебное слово "end"
    @text.pop
  end

  # Массив из трех строк даты создания + все строки (тело) заметки
  def to_strings
    time_string = "Создано: #{@created_at.strftime("%Y.%m.%d, %H:%M:%S")} \n\r \n\r"

    #  добавляем в массив текста в начало строчку времени и возвращаем
    return @text.unshift(time_string)
  end

  def to_db_hash
    # вызываем родительский метод ключевым словом super и к хэшу, который он вернул
    return super.merge(
        {
            'text' => @text.join('\n\r') # массив строк делаем одной большой строкой, разделенной символами перевода строки
        }
    )
  end

  # загружаем свои поля из хэш массива
  def load_data(data_hash)
    super(data_hash) #сперва дергаем родительский метод для инициализации общих полей

    # теперь прописываем свое специфичное поле
    @text = data_hash['text'].split('\n\r')
  end
end

